import React,{useState,useEffect,useRef} from "react";
import { StyledLoading } from './_style';
import gsap, {TweenMax,TimelineMax, Sine,Power4,Expo,Linear } from 'gsap';

const Loading = ({ 

 }) => {
  const LoadingRef = useRef(null);
  useEffect(
		() => { 
      const tl = gsap.timeline();
      tl.to([LoadingRef.current.children],4,
        {
        autoAlpha:1,
        repeat:-1,
        stagger:0.5
      })
      .to(LoadingRef.current,1,{
        autoAlpha:0
      })
    },
		[],
    );

  return (
    <>
      <StyledLoading ref={LoadingRef} className="loading">
    
<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 170 84.08 79.08">
	<filter id="blur1">
  <feGaussianBlur in="SourceGraphic" stdDeviation="2"/>
 </filter>

  <g id="Pork">
    <path id="Body" class="cls-1" d="M7.07 201.54s-2.68 4.34-.32 8l2.36 3.7s3.32 2 2.61 7.78c0 0-2.79.26-2.92 1.28s0 9.63 0 9.63 2 3.7 4.45 3.32 1.47-1.91 1.28-2.36-1.34-12 5.74-14.49 8.67 1.87 14 2.31 14.47-.83 14.47-.83-.89 10.78 2 11.92l3.32-.13s-4-12.62 4.85-12.18 21.42 8.29 22.76 2.93.32-4 .32-4-6.76-2.15-3.76-7.31 5.48-8.74 5.16-10.14c0 0-2.81 4.27-6.76 3.38s-11.16-14.54-38.7-13.84-30.6 8.35-30.6 8.35-3.86-1.34-1.55-3.76 2.31-2.36 1.42-3.06-3 3.19-3 3.19-2.74-1.56-2.42-4.08"/>
    <path id="Ear" class="cls-1" d="M73.23 202.08s3.27-1.31 3.59-3 .77 5.41.77 5.41"/>
    <path id="FrontFoot" class="cls-1" d="M54.44 222.13l7.65 8.29h2.36l-5-10.87"/>
    <path id="BackFoot" class="cls-1" d="M15.38 223.73s4.24 8 5.07 8.09 3.7-1.47 3.57-2-4.4-10-3.76-11.43"/>
  </g>
  <g id="Pork2" filter="url(#blur1)">
    <path id="Body" class="cls-1" d="M7.07 201.54s-2.68 4.34-.32 8l2.36 3.7s3.32 2 2.61 7.78c0 0-2.79.26-2.92 1.28s0 9.63 0 9.63 2 3.7 4.45 3.32 1.47-1.91 1.28-2.36-1.34-12 5.74-14.49 8.67 1.87 14 2.31 14.47-.83 14.47-.83-.89 10.78 2 11.92l3.32-.13s-4-12.62 4.85-12.18 21.42 8.29 22.76 2.93.32-4 .32-4-6.76-2.15-3.76-7.31 5.48-8.74 5.16-10.14c0 0-2.81 4.27-6.76 3.38s-11.16-14.54-38.7-13.84-30.6 8.35-30.6 8.35-3.86-1.34-1.55-3.76 2.31-2.36 1.42-3.06-3 3.19-3 3.19-2.74-1.56-2.42-4.08"/>
    <path id="Ear" class="cls-1" d="M73.23 202.08s3.27-1.31 3.59-3 .77 5.41.77 5.41"/>
    <path id="FrontFoot" class="cls-1" d="M54.44 222.13l7.65 8.29h2.36l-5-10.87"/>
    <path id="BackFoot" class="cls-1" d="M15.38 223.73s4.24 8 5.07 8.09 3.7-1.47 3.57-2-4.4-10-3.76-11.43"/>
  </g>

</svg>


<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 340 84.08 79.08">
	<filter id="blur1">
  <feGaussianBlur in="SourceGraphic" stdDeviation="2"/>
 </filter>

 <g id="Peppers">
    <g id="Pep-L">
      <path id="PepperBase" class="cls-1" d="M22.05 374.52s-1.28 12.63 2.29 18.49 7.91 12.7 7.78 11.09c-.26-3.09-.08 1.26 0-7 .09-9.2-1.28-13.13.26-16.32a32.8 32.8 0 0 0 1.59-3.94c.32-1 .45-1.55.45-1.55l.29-2.52"/>
      <path id="PepperTop" class="cls-2" d="M25.27 366.7s-6.09.48-6.79.19 3.06 7 6.6 6c2 2.26.89 2.77 1.37 4s-.19-4.37 5.9-5.52 6.79-4.56 6.79-4.56-6.31.38-7.52-.16"/>
      <path id="PepperStem" class="cls-2" d="M27.5 365.33s-1.88-7.4-5-10.55c.41-2.23.77-2 1.53-1.53s6 7.56 5.71 12.08"/>
    </g>
    <g id="Pep-R">
      <path id="PepperBase-2" data-name="PepperBase" class="cls-1" d="M53.99 382.07s-3.76 5.71-4.65 9.31-5.23 13.36-5.58 13.9l-.35.54c3.63-.7 14.06-8.7 15.94-12.11s2.84-5.58 3.51-6.06"/>
      <path id="PepperTop-2" data-name="PepperTop" class="cls-2" d="M59.48 379.15s-.86-2.45-5.55-1.88c0 0 3.89 4.69 1.63 8.13 0 0 1.69-2.36 3-1.59a4.25 4.25 0 0 1 1.82 3.67s2.9-7.46 6.12-3.47c0 0 .92-1.91-3.38-3.63 0 0 3.06-9.63 2.1-12.53s-2.65-.16-2.65-.16 1.88 7.4-1.08 11.38"/>
    </g>
  </g>
  <g id="Peppers2" filter="url(#blur1)">
    <g id="Pep-L">
      <path id="PepperBase" class="cls-1" d="M22.05 374.52s-1.28 12.63 2.29 18.49 7.91 12.7 7.78 11.09c-.26-3.09-.08 1.26 0-7 .09-9.2-1.28-13.13.26-16.32a32.8 32.8 0 0 0 1.59-3.94c.32-1 .45-1.55.45-1.55l.29-2.52"/>
      <path id="PepperTop" class="cls-2" d="M25.27 366.7s-6.09.48-6.79.19 3.06 7 6.6 6c2 2.26.89 2.77 1.37 4s-.19-4.37 5.9-5.52 6.79-4.56 6.79-4.56-6.31.38-7.52-.16"/>
      <path id="PepperStem" class="cls-2" d="M27.5 365.33s-1.88-7.4-5-10.55c.41-2.23.77-2 1.53-1.53s6 7.56 5.71 12.08"/>
    </g>
    <g id="Pep-R">
      <path id="PepperBase-2" data-name="PepperBase" class="cls-1" d="M53.99 382.07s-3.76 5.71-4.65 9.31-5.23 13.36-5.58 13.9l-.35.54c3.63-.7 14.06-8.7 15.94-12.11s2.84-5.58 3.51-6.06"/>
      <path id="PepperTop-2" data-name="PepperTop" class="cls-2" d="M59.48 379.15s-.86-2.45-5.55-1.88c0 0 3.89 4.69 1.63 8.13 0 0 1.69-2.36 3-1.59a4.25 4.25 0 0 1 1.82 3.67s2.9-7.46 6.12-3.47c0 0 .92-1.91-3.38-3.63 0 0 3.06-9.63 2.1-12.53s-2.65-.16-2.65-.16 1.88 7.4-1.08 11.38"/>
    </g>
  </g>
  
</svg>

<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 84.08 95.08">
	<filter id="blur1">
  <feGaussianBlur in="SourceGraphic" stdDeviation="2"/>
 </filter>

  <g id="Ramen">
    <path id="Bowl" class="cls-1" d="M79.31 59.29s-3.67 12.62-20.92 22.19a22.34 22.34 0 0 0-3.06 5.16s-8.54 4.72-21.61-.32c0 0 .45-4.08-1.66-5.29S7.07 70.15 10.32 51.44c0 0 3.51-3.63 41.19-2.81"/>
    <path id="BowlLip" class="cls-1" d="M13.38 57.44s43.36 13.2 64.77-2.39c0 0 8.49-5.95-19.44-6.53"/>
    <path id="Sticks" class="cls-1" d="M12.87 54.57s4.46 1 4-.83S5.41 32.25 5.41 32.25l1.53-1.4s12 27 14 24L11.34 26l1.15-2.74 11.66 32.71s9.44 2.93 21.74-.7 17.75-5.12 26.47-2.42"/>
    <path id="SoupLower" class="cls-1" d="M36.9 59.61s10.33-1 15.88-2.52a47.34 47.34 0 0 1 16.64-.94"/>
    <path id="Steam" class="cls-2" d="M54.44 50.15s11.48-8.29 10.07-15.75-19.06-18.43-19-21.61 2.87-3.76 0-12.31c0 0 1 3.57-4.14 8.54s-4.85 10.52 2.36 21.61-9.55 12.79-13.84 16c-3.57 2.68-3.06 7.91-3.06 7.91"/>
  </g>
  <g id="Ramen2" filter="url(#blur1)">
    <path id="Bowl" class="cls-1" d="M79.31 59.29s-3.67 12.62-20.92 22.19a22.34 22.34 0 0 0-3.06 5.16s-8.54 4.72-21.61-.32c0 0 .45-4.08-1.66-5.29S7.07 70.15 10.32 51.44c0 0 3.51-3.63 41.19-2.81"/>
    <path id="BowlLip" class="cls-1" d="M13.38 57.44s43.36 13.2 64.77-2.39c0 0 8.49-5.95-19.44-6.53"/>
    <path id="Sticks" class="cls-1" d="M12.87 54.57s4.46 1 4-.83S5.41 32.25 5.41 32.25l1.53-1.4s12 27 14 24L11.34 26l1.15-2.74 11.66 32.71s9.44 2.93 21.74-.7 17.75-5.12 26.47-2.42"/>
    <path id="SoupLower" class="cls-1" d="M36.9 59.61s10.33-1 15.88-2.52a47.34 47.34 0 0 1 16.64-.94"/>
    <path id="Steam" class="cls-2" d="M54.44 50.15s11.48-8.29 10.07-15.75-19.06-18.43-19-21.61 2.87-3.76 0-12.31c0 0 1 3.57-4.14 8.54s-4.85 10.52 2.36 21.61-9.55 12.79-13.84 16c-3.57 2.68-3.06 7.91-3.06 7.91"/>
  </g>
</svg>

<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 80 80">
	<filter id="blur1">
  <feGaussianBlur in="SourceGraphic" stdDeviation="2"/>
 </filter>

  <g id="Ramen">
  <text fill="#fff" x="20" y="35" class="small">うまい</text>
  </g>
  <g id="Ramen2" filter="url(#blur1)">
  <text fill="#fff" x="20" y="35" class="small">うまい</text>
  </g>
</svg>
      </StyledLoading>
    </>
  )
}

export default Loading